#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
random_password.flyte_db_password: Refreshing state... [id=none]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Reading...
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
data.google_client_config.default: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]
google_container_node_pool.flyte_node_pool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster/nodePools/flyte-np]
helm_release.flyte_single_cluster: Refreshing state... [id=flyte-test-setup]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.0.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "34.74.75.30" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/zones/us-east1-b/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.3.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRVXBsb0lkYW1ZaWZjK0FhdnRZWFAwekFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlSbU5tRmlOR1pqWVMweVltWTRMVFF6WXprdFlqazRNQzB4TldNNE9EazFZV0UwWkRZdwpJQmNOTWpNd056SXdNRGd5TWpVNVdoZ1BNakExTXpBM01USXdPVEl5TlRsYU1DOHhMVEFyQmdOVkJBTVRKR1kyCllXSTBabU5oTFRKaVpqZ3RORE5qT1MxaU9UZ3dMVEUxWXpnNE9UVmhZVFJrTmpDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU1vcHQzaEdubkM3c3FoZHJYUWVNMVVsRGtUNmxkZGtEYWVZK1hJSwo4Mk82OUR5NUp3Zks3SlkxMjNIL05ZenRCWDRSVjFKaFBITWdCMWZaM2dQVSsvbXA1Ulh4S3lKZTNnM2g3RkpiCmdXNTdWMXo2Z2FhMm5zZ0RkSEphUUFTZVJkYmY4WHFvNjB5MStRM3JVT3JEd1hmV1EvdnkrZ3FFeHViODJ3RncKVVkwY3Z6MVJ2UWJOZ1hiY0lLR1ZjOHR4cnJwUVRxM05scWdOdmdwWktIMzk4VDNmd1FuTHRGSXcwYWJQZG5tQQpaYmpiSnVsd2RCOHFpNzlWcjNnYkIyTGdrRVMyRzdROUt0cm9RQ2hLVjhvT0l3TXlKVlM1cmZOeGdFWFB5QlFzCitxcVJSTWFEUCtuT1ZZcWFabXpsVjlXTnJJeU5IZVJHQ2MxTExlb3lRc2FjbE5wYS9DcjNxY2NpK255WERwcm8KT0s2d1lFLzNkOHJDbENQOGNJSEVjUjJCWWxab2gyYmU2TVkzSWpHNWhkK2NINUlCbEtQSnVBTitxeGkzT1NKTQpyTCtscElNYUxqSjBsaGpHRWd4c0o2U1NCakVCVGZJVTFFMFNWYVNjNVR4cElkc3o1TkNhUjl6MFN3a3RMc1BKCjk1cU9GMFpjR2h1OTZsNzUrbnVGNmlWS2pRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVV6UVg2L2JWYVJhb2hxU2p2blM3WFEvWWNUNnN3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFEcnQ0bHlBMExuVytCZVU4d2xJZkNzeURCNitXTjFZUExKOXRibHVwYk1zCkVFT2NlU3hraWVQMUtHU09LSW1kWE50c3lwZnhwKytxQlhrUUc3ZVBVRDBtQXRaRHpldmVzNityUmlTS0JxaHMKK3ZvRmhlUE9tZjgyOFhDV2Y4eVFWTFk3QnNUaDVQOFhZRHFDR3NKdEJTZHd1dmdhZ05FWk1rNzlOcVFBMUkzUwpjenlLOCtCSkdxRnhKYnFVbk5qaW4vUVpRcUJUeXRLTXdOblgvdng1ajRhQkdZaEY0eGdUaU5pYUkwRVZZSUJjClNCZS9WUlBnbFpwbFJpanF2NzNBenJERUI2RkIxSWpqdzEyR1BMM0JuSS9PQlpXbkcxR3lZNS9MU2g2REd3a04KUHA5ZUlpN1NaNTdBWVJRUzhhRUFvNHRsUXE1bXNVMm9SQmlwY0lFV3hYMGk3a05BZXphaTc1WDVzazgzbDlabgptVDRDL3Z5MTVNZkg3TWlOeTM1bGxQdjZFZGRMTmRPWFJOSTNnaUhNM0lra3hteW44YVMwYXRhQkVWWlVmY3VWClI1WVQ2UTJGQUZINVFyaTVoMkFYMDArUXhaT2IybVMyUTlGcVJIdEc2UkpPL1FXK1Npd3VJY0V0UHd3QU9HNFUKTEdKVTZUQ0doa1h1Tk0ycFB5YnEyUT09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      ~ node_config {
          ~ disk_size_gb      = 100 -> 10 # forces replacement
          ~ guest_accelerator = [] -> (known after apply)
          ~ image_type        = "COS_CONTAINERD" -> (known after apply)
          ~ labels            = {} -> (known after apply)
          ~ local_ssd_count   = 0 -> (known after apply)
          ~ machine_type      = "e2-medium" -> (known after apply)
          ~ metadata          = {
              - "disable-legacy-endpoints" = "true"
            } -> (known after apply)
          + min_cpu_platform  = (known after apply)
          ~ oauth_scopes      = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> (known after apply)
          ~ preemptible       = true -> false # forces replacement
          - resource_labels   = {} -> null
          ~ service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> (known after apply)
          - tags              = [] -> null
          ~ taint             = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "instance_type"
                  - value  = "spot"
                },
            ] -> (known after apply)
            # (3 unchanged attributes hidden)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }
        }

      - node_pool {
          - initial_node_count          = 2 -> null
          - instance_group_urls         = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroupManagers/gke-flyte-cluster-flyte-np-af853836-grp",
            ] -> null
          - managed_instance_group_urls = [
              - "https://www.googleapis.com/compute/v1/projects/exemplary-tide-379122/zones/us-east1-b/instanceGroups/gke-flyte-cluster-flyte-np-af853836-grp",
            ] -> null
          - max_pods_per_node           = 0 -> null
          - name                        = "flyte-np" -> null
          - node_count                  = 2 -> null
          - node_locations              = [
              - "us-east1-b",
            ] -> null
          - version                     = "1.26.5-gke.1200" -> null

          - autoscaling {
              - location_policy      = "ANY" -> null
              - max_node_count       = 4 -> null
              - min_node_count       = 2 -> null
              - total_max_node_count = 0 -> null
              - total_min_node_count = 0 -> null
            }

          - management {
              - auto_repair  = true -> null
              - auto_upgrade = true -> null
            }

          - network_config {
              - create_pod_range     = false -> null
              - enable_private_nodes = false -> null
            }

          - node_config {
              - disk_size_gb      = 100 -> null
              - disk_type         = "pd-balanced" -> null
              - guest_accelerator = [] -> null
              - image_type        = "COS_CONTAINERD" -> null
              - labels            = {} -> null
              - local_ssd_count   = 0 -> null
              - logging_variant   = "DEFAULT" -> null
              - machine_type      = "e2-medium" -> null
              - metadata          = {
                  - "disable-legacy-endpoints" = "true"
                } -> null
              - oauth_scopes      = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ] -> null
              - preemptible       = true -> null
              - resource_labels   = {} -> null
              - service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com" -> null
              - spot              = false -> null
              - tags              = [] -> null
              - taint             = [
                  - {
                      - effect = "NO_SCHEDULE"
                      - key    = "instance_type"
                      - value  = "spot"
                    },
                ] -> null

              - shielded_instance_config {
                  - enable_integrity_monitoring = true -> null
                  - enable_secure_boot          = false -> null
                }
            }

          - upgrade_settings {
              - max_surge       = 1 -> null
              - max_unavailable = 0 -> null
              - strategy        = "SURGE" -> null
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.15.201" -> null
          - public_endpoint         = "34.74.75.30" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*